hello word

In [1]:
import pandas as pd

In [2]:
#series is a one dimentional array as object.
s=pd.Series([3,4,1,6])
s

0    3
1    4
2    1
3    6
dtype: int64

In [4]:
#head returns top 5 rows
s.head(2)

0    3
1    4
dtype: int64

In [35]:
#It uses comma (,) as default delimiter or separator while parsing a file ->(sep=',')
#creating a variablre called ufo and reading data from URL into that variable.
ufo=pd.read_table('http://bit.ly/uforeports' ,sep=',')

In [7]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [8]:
ufo['State']

0        NY
1        NJ
2        CO
3        KS
4        NY
         ..
18236    IL
18237    IA
18238    WI
18239    WI
18240    FL
Name: State, Length: 18241, dtype: object

In [16]:
ufo['Location']=ufo.City +','+ ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

In [17]:
ufo.shape

(18241, 6)

In [19]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
Location           object
dtype: object

In [20]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [24]:
#axis=1 to remove the column
#axis=0 to remove the row
#inplce(True)=It is a boolean which makes the changes in data frame itself if True.Dropping Rows with at least 1 null value.

In [33]:
ufo.drop(['City'],axis=1,inplace=True)
ufo.head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00

In [34]:
ufo=pd.read_table('http://bit.ly/uforeports' ,sep=',')

In [38]:
ufo.State.sort_values(ascending=False).head(25)

12079    WY
11490    WY
11333    WY
4866     WY
3326     WY
3328     WY
16594    WY
1177     WY
378      WY
5065     WY
7684     WY
6116     WY
10729    WY
12072    WY
16637    WY
14618    WY
7491     WY
12063    WY
14240    WY
14586    WY
15667    WY
7485     WY
14747    WY
1461     WY
1442     WY
Name: State, dtype: object

In [39]:
ufo.sort_values('City')

            City Colors Reported Shape Reported State              Time
1761   Abbeville             NaN           DISK    SC   12/10/1968 0:30
4553    Aberdeen             NaN       CYLINDER    WA   6/15/1981 22:00
16167   Aberdeen             NaN        VARIOUS    OH    3/29/2000 3:00
14703   Aberdeen             NaN       TRIANGLE    WA   9/30/1999 21:00
389     Aberdeen          ORANGE         CIRCLE    SD  11/15/1956 18:30
...          ...             ...            ...   ...               ...
12441        NaN             RED       FIREBALL    WA  10/26/1998 17:58
15767        NaN             NaN      RECTANGLE    NV   1/21/2000 11:30
15812        NaN             NaN          LIGHT    NV     2/2/2000 3:00
16054        NaN           GREEN            NaN    FL    3/11/2000 3:30
16608        NaN             NaN         SPHERE    NY   6/15/2000 15:00

[18241 rows x 5 columns]

In [40]:
ufo.sort_values(['City','State']).head()

            City Colors Reported Shape Reported State              Time
1761   Abbeville             NaN           DISK    SC   12/10/1968 0:30
2297    Aberdeen             NaN       TRIANGLE    MD    8/18/1972 1:30
9404    Aberdeen             NaN           DISK    MD   6/15/1996 13:30
16167   Aberdeen             NaN        VARIOUS    OH    3/29/2000 3:00
389     Aberdeen          ORANGE         CIRCLE    SD  11/15/1956 18:30

In [42]:
ufo.describe()

#The describe() method is used for calculating some statistical data like percentile,
#mean and std of the numerical values of the Series or DataFrame.

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27